<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [2]:
import pandas as pd
import psycopg2

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [4]:
# текст запроса
query_3_1 = f'''select count(*) from vacancies
'''

In [5]:
# результат запроса
df = pd.read_sql_query(query_3_1, connection)
df

/tmp/ipykernel_15500/1114379196.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

   count
0  49197

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [6]:
# текст запроса
query = f'''select count(*) from employers
'''

In [7]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  23501

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
# текст запроса
query = f'''select count(*) from areas
'''

In [9]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   1362

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [10]:
# текст запроса
query = f'''select count(*) from industries
'''

In [11]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    294

***

In [ ]:
# выводы по предварительному анализу данных

'''
У нас имеется 23 501 компания из 294 отраслей деятельности, расположившие 49 197 вакансий в 1362 регионах. По количеству
регионов можно судить, что это не субъекты РФ, а города. Количество вакансий и количество компаний сравнимо - вторых
всего примерно в 2 раза меньше, чем первых 
'''

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [16]:
# текст запроса
query = f'''select 
                a.name area,
                count(v.id) cnt
            from vacancies v
                left join areas a on v.area_id = a.id 
            group by a.id
            order by cnt desc
'''

In [17]:
# результат запроса
df = pd.read_sql_query(query, connection)
df.head()

/tmp/ipykernel_15500/1821789316.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [18]:
# текст запроса
query = f'''select
                count(v.id)
            from vacancies v
            where v.salary_from is not Null
            or v.salary_to is not Null
'''

In [19]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0  24073

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [22]:
# текст запроса
query = f'''select
                round(AVG(v.salary_from)) salary_from,
                round(AVG(v.salary_to)) salary_to
            from vacancies v
'''

In [23]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   salary_from  salary_to
0      71065.0   110537.0

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [24]:
# текст запроса
query = f'''select
                v.schedule schedule,
                v.employment employment,
                count(v.id)
            from vacancies v
            group by v.schedule, v.employment
            order by count(v.id) DESC
'''

In [25]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [26]:
# текст запроса
query = f'''select
                v.experience experience,
                count(v.id)
            from vacancies v
            group by v.experience
            order by count(v.id)
'''

In [27]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

***

In [ ]:
# выводы по детальному анализу вакансий
'''
Наибольшее количество вакансий расположено в Москве, следующий за ней регион - Санкт-Петербург. Можно предположить, что сервисом HH пользуются в основном работодатели
из крупных городов.

У значительного числа вакансий отсутствует упоминание о предлагаемой зарплате, что может быть вызвано желанием работодателя не афишировать важную 
для принятия решения о трудоустройстве информацию с целью получить большую вероятность того, что соискатель согласится с их предложением и не будет 
рассматривать другие соблазнительные вакансии.

Среди вакансий, в которых была указана заработная плата, среднее значение верхнего предела - около 110 тысяч, что, на самом деле, довольно низко 
по современным ценам и может косвенно указывать, что для наиболее высокооплачиваемых должностей размер зарплаты работодатель предпочитает не указывать

Наибольшее количество вакансий относится к группе "Полная занятость, полный рабочий день", вакансий с удаленной работой относительно немного, что может
говорить как о том, что работодатели в принципе не готовы рассматривать удаленную занятость, так и о том, что большая часть работы, для выполнения которой 
работодатель ищет исполнителей, очень сложно или даже невозможно выполнять удаленно. Кроме того, это может означать, что база данных вакансий актуальна на время 
до пандемии, когда удаленная работа еще не была распространена повсеместно. Подтвердить или опровергнуть это невозможно, так как в таблице с вакансиями
нет даты публикации. 

Наиболее часто встречающийся желаемый опыт работы - от года до трех лет. Это может говорить о том, что работодатели считают подобное количество опыта
наиболее оптимальным для выполнения большей части работы. Меньше всего ищут людей с опытом работы более шести лет. Это может говорить о том, что люди, обладающие
сравнительно большим опытом работы, требуются на руководящих должностях и на должностях ведущих специалистов, количество вакансий для которых меньше, чем 
для рядовых сотрудников.
'''

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [41]:
# текст запроса
query = f'''(select
                e.name employer,
                count(v.id) cnt
            from vacancies v
                 left join employers e on v.employer_id = e.id
            group by e.id
            order by count(v.id) desc
            limit 1)
            union
            (select
                e.name,
                count(v.id)
            from vacancies v
                 left join employers e on v.employer_id = e.id
            group by e.id
            order by count(v.id) desc
            offset 4 limit 1)
            order by cnt desc
'''

In [42]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

        employer   cnt
0         Яндекс  1933
1  Газпром нефть   331

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [49]:
# текст запроса
query = f'''select
                a.name region,
                count(v.id) vacancies,
                count(e.id) employers
            from areas a
                left join vacancies v on a.id = v.area_id
                left join employers e on e.area = a.id
            group by a.id
            having count(v.id) = 0
            order by count(e.id) desc
            limit 1
'''

In [50]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   region  vacancies  employers
0  Россия          0        410

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [61]:
# текст запроса
query = f'''select
                e.name employer,
                count(distinct v.area_id) areas_cnt
            from vacancies v
                left join employers e on v.employer_id = e.id
            group by e.id
            order by count(distinct v.id) desc
'''

In [62]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                             employer  areas_cnt
0                              Яндекс        181
1                          Ростелеком        152
2                            Тинькофф         43
3                                СБЕР         24
4                       Газпром нефть         24
...                               ...        ...
14901         Торговый Дом Петровский          1
14902                      А2 Юнайтед          1
14903                    ТСЦ Дровосек          1
14904                  ПАВЛОДАРЭНЕРГО          1
14905  ЧЕТЫРЕ ЛАПЫ, Сеть зоомагазинов          1

[14906 rows x 2 columns]

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [73]:
# текст запроса
query = f'''select
                count(e.id)
            from employers e
            left join employers_industries ei on ei.employer_id = e.id
            where industry_id is null
'''

In [74]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   8419

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [77]:
# текст запроса
query = f'''select
                e.name,
                count(ei.industry_id)
            from employers e
            left join employers_industries ei on ei.employer_id = e.id
            group by e.id
            having count(ei.industry_id) = 4
            order by e.name
            offset 2 limit 1
'''

In [78]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   name  count
0  2ГИС      4

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [79]:
# текст запроса
query = f'''select
                count(ei.employer_id)
            from employers_industries ei
                left join industries i on ei.industry_id = i.id
            group by i.id
            having i.name = 'Разработка программного обеспечения'

'''

In [80]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0   3553

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [107]:
# код для получения списка городов-милионников
import requests #импортируем библиотеку requests
from bs4 import BeautifulSoup # Импортируем библиотеку BeautifulSoup
from pprint import pprint # Импортируем функцию pprint()

url = 'https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8' # Задаём адрес ресурса
response = requests.get(url) # Делаем GET-запрос к ресурсу
page = BeautifulSoup(response.text, 'html.parser') # Создаём объект BeautifulSoup

table = page.find_all('tbody') #ищем на странице все таблицы, нам нужна вторая из них
hrefs = table[1].find_all('a') #ищем в найденной таблице все ссылки, нам нужны ссылки на города, а это - начиная с 5 ссылки

millions_cities = []  #массив для городов-миллионников

for i in range(4, len(hrefs)): # начинаем с 5-й ссылки, потому что первые четыре не относятся к городам
    millions_cities.append(hrefs[i].contents[0]) #извлекаем из ссылок из отображаемую часть, она и есть названия городов
    
m_cities = ', '.join(f"'{w}'" for w in millions_cities)

print(m_cities)

'Москва', 'Санкт-Петербург', 'Новосибирск', 'Екатеринбург', 'Казань', 'Нижний Новгород', 'Красноярск', 'Челябинск', 'Самара', 'Уфа', 'Ростов-на-Дону', 'Краснодар', 'Омск', 'Воронеж', 'Пермь', 'Волгоград'

In [142]:
# текст запроса
query = f'''(select
                a.name city,
                count(v.id) cnt
            from vacancies v
                left join areas a on v.area_id = a.id
                left join employers e on v.employer_id = e.id
                where e.name = 'Яндекс'
            group by a.id
            having a.name in ({m_cities}) 
            )
            union
            (select
                distinct 'Total',
                count(v.id)
            from vacancies v
                left join areas a on v.area_id = a.id
                left join employers e on v.employer_id = e.id
                where (a.name in ({m_cities}))
                and (e.name = 'Яндекс')  
            )    
            order by cnt
'''

In [143]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

               city  cnt
0              Омск   21
1         Челябинск   22
2        Красноярск   23
3         Волгоград   24
4             Пермь   25
5            Казань   25
6    Ростов-на-Дону   25
7               Уфа   26
8            Самара   26
9         Краснодар   30
10          Воронеж   32
11      Новосибирск   35
12  Нижний Новгород   36
13     Екатеринбург   39
14  Санкт-Петербург   42
15           Москва   54
16            Total  485

***

In [303]:
query = f'''select
                e.name,
                count(ei.industry_id)
            from employers e
            left join employers_industries ei on ei.employer_id = e.id
            group by e.id
            having count(ei.industry_id) > 0
            order by count(ei.industry_id) DESC
'''
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/2996787381.py:10: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                            name  count
0                      МСК ГРУПП      5
1                    Физика Сети      5
2                       Пневмакс      5
3                    АК БАРС ДОМ      5
4                       Трекмарк      5
...                          ...    ...
15077    Студия Интернет Решений      1
15078                IT Universe      1
15079                 СимбирСофт      1
15080                   Агротрак      1
15081  Interactive Standard, LLC      1

[15082 rows x 2 columns]

In [ ]:
# выводы по анализу работодателей

'''
Наибольшее количество вакансий из всех работодателей принадлежит компании Яндекс

В базе данных присутсвует более 3000 компаний, указавших в качестве своей деятельности "Разработка программного обеспечения".

Компания Яндекс не только разместила больше всех вакансий, но и разместила их в значительно большим, чем остальные компании, количестве регионов. 

В базе данных присутствует странный регион под названием Россия, у которого 410 работодателей, но ни одной вакансии. Возможно, это связано с какими-то ошибками
в данных или неправильным заполнением информации о работодателях. Возможно так же, что эти работодатели изначально просто не указали свой регион, и "Россия"
была выбрана по умолчанию. 
'''

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [148]:
# текст запроса
query = f'''select
                count(v.id) cnt
            from vacancies v
            where
             LOWER(v.name) like ('%данн%')
             or
             LOWER(v.name) like ('%data%')

'''

In [149]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

    cnt
0  1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [277]:
# текст запроса
query = f'''select
                count(v.id) cnt
            from vacancies v
            where
             (lower(v.name) like ('%data%scientist%')
             or
             lower(v.name) like ('%data%science%')
             or
             lower(v.name) like ('%исследователь%данных%')
             or
             (v.name like('%ML%') and v.name not like ('%HTML%'))
             or
             lower(v.name) like ('%machine%learning%')
             or
             lower(v.name) like ('%машинн%обучен%')
             )
            and
             (lower(v.name) like ('%junior%')
             or
             lower(v.experience) like ('%нет опыта%')
             or
             lower(v.employment) like ('%стажировка%')
             )
'''

In [278]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   cnt
0   51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [271]:
# текст запроса
query = f'''select
                count(v.id) cnt
            from vacancies v
            where
             (lower(v.name) like ('%data%scientist%')
             or
             lower(v.name) like ('%data%science%')
             or
             lower(v.name) like ('%исследователь%данных%')
             or
             (v.name like('%ML%') and v.name not like ('%HTML%'))
             or
             lower(v.name) like ('%machine%learning%')
             or
             lower(v.name) like ('%машинн%обучен%')
             )
            and
             (v.key_skills like ('%SQL%')
             or
            v.key_skills like ('%postgres%')
)
'''

In [272]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   cnt
0  201

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [275]:
# текст запроса
query = f'''select
                count(v.id)
            from vacancies v
            where
             (lower(v.name) like ('%data%scientist%')
             or
             lower(v.name) like ('%data%science%')
             or
             lower(v.name) like ('%исследователь%данных%')
             or
             (v.name like('%ML%') and v.name not like ('%HTML%'))
             or
             lower(v.name) like ('%machine%learning%')
             or
             lower(v.name) like ('%машинн%обучен%')
             )
            and
             (lower(v.key_skills) like ('%python%')
             )
'''

In [276]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   count
0    351

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [281]:
# текст запроса

query = f'''select
                round(avg(cardinality(
                        regexp_split_to_array(
                                v.key_skills,
                                '\t')
                            )), 2)
            from vacancies v
            where
             (lower(v.name) like ('%data%scientist%')
             or
             lower(v.name) like ('%data%science%')
             or
             lower(v.name) like ('%исследователь%данных%')
             or
             (v.name like('%ML%') and v.name not like ('%HTML%'))
             or
             lower(v.name) like ('%machine%learning%')
             or
             lower(v.name) like ('%машинн%обучен%')
             )
'''

In [282]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

   round
0   6.41

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [307]:
# текст запроса
query = f'''select
                round(avg((coalesce(v.salary_from, v.salary_to, 0) + coalesce(v.salary_to, v.salary_from, 0))/2), 0),
                v.experience
            from vacancies v
            where
             (lower(v.name) like ('%data%scientist%')
             or
             lower(v.name) like ('%data%science%')
             or
             lower(v.name) like ('%исследователь%данных%')
             or
             (v.name like('%ML%') and v.name not like ('%HTML%'))
             or
             lower(v.name) like ('%machine%learning%')
             or
             lower(v.name) like ('%машинн%обучен%')
             )
            and (
                 v.salary_from is not null
                 or
                 v.salary_to is not null
             )

             group by v.experience
'''

In [308]:
# результат запроса
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1115395102.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

      round          experience
0   74643.0           Нет опыта
1  139675.0  От 1 года до 3 лет
2  243115.0       От 3 до 6 лет

***

In [ ]:
# выводы по предметному анализу
'''
В базе данных 1771 вакансия имеет отношение к Дата Сайенс, причем только в 351 из них в качестве ключевого навыка указан Python, и только для 201 вакансии
указан SQL либо Postgres. В среднем для таких вакансий
указывается около 6 ключевых навыков. Зарплаты для дата сайентистов с опытом работы больше года в среднем превышают зарплаты для других вакансий, причем для 
желаемого опыта работы от 3 до 6 лет - больше чем в два раза. 
'''

# Общий вывод по проекту

In [ ]:
# подведем итог исследования, обобщите выводы
'''
Вакансии в базе данных привязаны не к регионам, а к городам России, при этом далеко не все работодатели в базе имеют вакансии. Больше всего вакансий в базе данных 
для полного рабочего дня и полной занятости, что говорит о том, что либо работодатели в большинстве своем не готовы обеспечивать удаленную работу, либо это база данных
времен до пандемии, либо возможность удаленной работы рассматривается, но не отмечается в соответствующем столбце.

Больше всего вакансий у компании "Яндекс", у нее же они размещены в наибольшем количестве городов, при этом бОльшая часть вакансий - не в городах-миллионниках.

В базе довольно значительное количество вакансий в области Дата Сайенс, причем зарплата у таких специалистов выше среднерыночной. При этом важные для работы 
дата сайентиста навыки - Python, SQL и Postgres - указаны относительно редко. 

Больше всего вакансий в Москве, вероятно, это связано с размерами города и, вероятно, с тем, что это столица. 
'''


# здесь можно (это будет плюсом) провести дополнительные исследования данных, сделать прогнозы, продумать варианты продолжения исследования

In [309]:
# Посмотрим, какие области деятельности указала для себя компания Яндекс
query = f'''select
                i.name industry,
                e.name company
            from employers_industries ei
                left join industries i on ei.industry_id = i.id
                left join employers e on ei.employer_id = e.id
            group by i.id, e.id
            having e.name = 'Яндекс'

'''
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_15500/1261252525.py:12: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                                            industry company
0  Интернет-компания (поисковики, платежные систе...  Яндекс

Видно, что Яндекс, несмотря на свои размеры и количество вакансий, указывает всего одну сферу деятельности, и это не "Разработка программного обеспечения"

In [5]:
#Посмотрим, сколько компаний указало сферу деятельности и какое максимальное количество сфер деятельности указывают
query = f'''select
                e.name,
                count(ei.employer_id)
            from employers e
            left join employers_industries ei on ei.employer_id = e.id
            group by e.id
            having count(ei.industry_id) > 0
            order by count(ei.industry_id) DESC
'''
df = pd.read_sql_query(query, connection)
df

/tmp/ipykernel_43699/3188111960.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, connection)

                            name  count
0                      МСК ГРУПП      5
1                    Физика Сети      5
2                       Пневмакс      5
3                    АК БАРС ДОМ      5
4                       Трекмарк      5
...                          ...    ...
15077    Студия Интернет Решений      1
15078                IT Universe      1
15079                 СимбирСофт      1
15080                   Агротрак      1
15081  Interactive Standard, LLC      1

[15082 rows x 2 columns]

Видно, что наибольшее количество указанных сфер деятельности - 5. Здесь можно провести исследование на предмет, зависит ли количество вакансий от количества
сфер деятельности и как, если зависит. Можно также попробовать посмотреть, есть ли зависимость между регионами компаний и количеством сфер деятельности компании, 
а также есть ли зависимость между количеством вакансий в компании и количеством регионов, в которых эта компания размещает вакансии.
Можно также посмотреть, зависит ли количество ДС вакансий от региона и как, если зависит.